In [1]:
!pip install -q sqlalchemy

In [2]:
!pip show sqlalchemy

Name: SQLAlchemy
Version: 2.0.30
Summary: Database Abstraction Library
Home-page: https://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: C:\python\Lib\site-packages
Requires: greenlet, typing-extensions
Required-by:

In [3]:
import os 
os.getcwd()

'c:\\Users\\acer\\Desktop\\BOOTDTASC\\Codigos proyecto'

In [4]:
import pandas as pd
from sqlalchemy import create_engine, text

In [19]:
pd.options.display.max_rows = 100


ruta="c:/Users/acer/Desktop/BOOTDTASC/Codigos proyecto/"

In [20]:
engine=create_engine('sqlite://') #indica que se está utilizando el motor de base de datos SQLite.
print(engine)

Engine(sqlite://)

In [30]:
def runQuery(sql):
    result = engine.connect().execute((text(sql)))
    return pd.DataFrame(result.fetchall(), columns=result.keys())

In [31]:
df = pd.read_csv('FTNT_stock_data.csv').to_sql('FTNT', engine, if_exists='replace', index=False)
def runQuery(sql):
    result = engine.connect().execute((text(sql)))
    return pd.DataFrame(result.fetchall(), columns=result.keys())

In [38]:
query_ejemplo= """
SELECT * FROM FTNT
WHERE close > 22.733999
"""
t=runQuery(query_ejemplo)
t

,Date,Open,High,Low,Close,Adj Close,Volume
0,2020-01-08,22.389999,22.879999,22.360001,22.733999,22.733999,6953000
1,2020-01-09,23.002001,23.156000,22.688000,22.896000,22.896000,5476500
2,2020-01-10,22.969999,23.059999,22.771999,22.864000,22.864000,3483000
3,2020-01-13,23.240000,23.350000,22.968000,23.337999,23.337999,4216500
4,2020-01-14,23.504000,23.534000,23.264000,23.344000,23.344000,3981000
...,...,...,...,...,...,...,...
1008,2024-04-03,68.610001,72.019997,68.580002,71.320000,71.320000,7868900
1009,2024-04-04,72.029999,73.629997,69.209999,69.230003,69.230003,6959700
1010,2024-04-05,69.750000,71.830002,69.339996,70.910004,70.910004,7474700
1011,2024-04-08,70.040001,70.239998,68.230003,68.389999,68.389999,5099900
1012,2024-04-09,69.139999,69.139999,67.800003,68.220001,68.220001,2799600

In [39]:
query_ejemplo = """
SELECT * FROM FTNT
ORDER BY close DESC
LIMIT 5
"""

# Ejecutar la consulta
t = runQuery(query_ejemplo)

# Mostrar los resultados
print(t)

         Date       Open       High        Low      Close  Adj Close   Volume
0  2023-07-17  78.720001  80.599998  78.580002  80.279999  80.279999  4185300
1  2023-07-18  79.959999  80.440002  79.160004  80.239998  80.239998  4586200
2  2023-07-14  78.550003  80.029999  78.339996  78.919998  78.919998  4913400
3  2023-07-19  80.449997  81.239998  78.300003  78.690002  78.690002  5985000
4  2023-07-25  77.730003  78.620003  77.410004  78.339996  78.339996  3679000

In [46]:
query_ejemplo= """
SELECT * FROM FTNT
WHERE open > 80.279999
"""
t=runQuery(query_ejemplo)
t

         Date       Open       High        Low      Close  Adj Close   Volume
0  2023-07-19  80.449997  81.239998  78.300003  78.690002  78.690002  5985000

In [53]:
query_ejemplo= """
SELECT * FROM FTNT
WHERE open = Close
"""
t=runQuery(query_ejemplo)
t

         Date    Open       High        Low   Close  Adj Close   Volume
0  2020-08-05  28.024  28.160000  27.530001  28.024     28.024  6705000
1  2023-01-09  49.410  50.669998  49.299999  49.410     49.410  4539700
2  2023-08-22  58.320  58.610001  57.779999  58.320     58.320  4843300

In [54]:
query_ejemplo = """
SELECT * FROM FTNT
ORDER BY Volume DESC
LIMIT 5
"""

# Ejecutar la consulta
t = runQuery(query_ejemplo)

# Mostrar los resultados
print(t)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2021-12-17  63.273998  67.438004  63.023998  66.765999  66.765999  48309500
1  2023-11-03  44.500000  50.570000  44.119999  50.480000  50.480000  38057000
2  2023-08-04  60.419998  61.360001  56.099998  56.770000  56.770000  32817900
3  2020-05-07  24.186001  27.370001  24.086000  27.024000  27.024000  26798000
4  2020-03-24  18.101999  20.160000  18.101999  19.955999  19.955999  26132500